In [1]:
# pip install pandas

In [2]:
import pandas as pd
import numpy as np

In [3]:
label = ['a', 'b', 'c', 'd']
my_arr = np.array([10, 20, 30, 40])
my_li = [10, 20, 30, 40]

d = {10:'a', '20':20, 'c':30, 40:'d'}

In [4]:
pd.Series(label)

0    a
1    b
2    c
3    d
dtype: object

In [6]:
pd.Series(data = label, index = my_arr)

10    a
20    b
30    c
40    d
dtype: object

In [7]:
pd.Series(data = d)

10     a
20    20
c     30
40     d
dtype: object

In [9]:
pd.Series(my_li).astype('int32')

0    10
1    20
2    30
3    40
dtype: int32

In [11]:
pd.Series(my_li).astype('float32')

0    10.0
1    20.0
2    30.0
3    40.0
dtype: float32

In [12]:
ser1 = pd.Series(data = [1, 2, 3, 4], index = ['USA', 'Japan', 'India', 'Italy'])
ser1

USA      1
Japan    2
India    3
Italy    4
dtype: int64

In [13]:
ser2 = pd.Series(data = [1, 2, 5, 4], index = ['USA', 'Japan', 'Germany', 'Italy'])
ser2

USA        1
Japan      2
Germany    5
Italy      4
dtype: int64

In [14]:
ser1 + ser2

Germany    NaN
India      NaN
Italy      8.0
Japan      4.0
USA        2.0
dtype: float64

In [15]:
np.random.seed(100)

In [18]:
df = pd.DataFrame(np.random.randn(5, 4), index = ['A', 'B', 'C', 'D', 'E'], columns = ['W', 'X', 'Y', 'Z'])

In [19]:
df

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [20]:
df['Y']

A   -0.251879
B    0.731000
C    0.222400
D    0.750445
E   -1.356399
Name: Y, dtype: float64

In [22]:
type(df['Y'])

pandas.core.series.Series

In [23]:
df[['Y']]

          Y
A -0.251879
B  0.731000
C  0.222400
D  0.750445
E -1.356399

In [24]:
df[['Y', 'W']]

          Y         W
A -0.251879  1.618982
B  0.731000  0.184519
C  0.222400 -0.326238
D  0.750445 -0.756352
E -1.356399  1.189622

In [25]:
df.Y

A   -0.251879
B    0.731000
C    0.222400
D    0.750445
E   -1.356399
Name: Y, dtype: float64

In [26]:
df

          W         X         Y         Z
A  1.618982  1.541605 -0.251879 -0.842436
B  0.184519  0.937082  0.731000  1.361556
C -0.326238  0.055676  0.222400 -1.443217
D -0.756352  0.816454  0.750445 -0.455947
E  1.189622 -1.690617 -1.356399 -1.232435

In [27]:
df['new'] = df['Y'] + df['Z']

In [28]:
df

          W         X         Y         Z       new
A  1.618982  1.541605 -0.251879 -0.842436 -1.094315
B  0.184519  0.937082  0.731000  1.361556  2.092556
C -0.326238  0.055676  0.222400 -1.443217 -1.220817
D -0.756352  0.816454  0.750445 -0.455947  0.294498
E  1.189622 -1.690617 -1.356399 -1.232435 -2.588834

In [29]:
df['new2'] = [1, 2, 3, 4, 5]

In [30]:
df

          W         X         Y         Z       new  new2
A  1.618982  1.541605 -0.251879 -0.842436 -1.094315     1
B  0.184519  0.937082  0.731000  1.361556  2.092556     2
C -0.326238  0.055676  0.222400 -1.443217 -1.220817     3
D -0.756352  0.816454  0.750445 -0.455947  0.294498     4
E  1.189622 -1.690617 -1.356399 -1.232435 -2.588834     5

In [31]:
df['new3'] = {10:'a', 20:'b', 30:'c', 40:'d', 50:'e'}

In [32]:
df

          W         X         Y         Z       new  new2  new3
A  1.618982  1.541605 -0.251879 -0.842436 -1.094315     1    10
B  0.184519  0.937082  0.731000  1.361556  2.092556     2    20
C -0.326238  0.055676  0.222400 -1.443217 -1.220817     3    30
D -0.756352  0.816454  0.750445 -0.455947  0.294498     4    40
E  1.189622 -1.690617 -1.356399 -1.232435 -2.588834     5    50

In [34]:
df.drop('new2', axis = 1)

          W         X         Y         Z       new  new3
A  1.618982  1.541605 -0.251879 -0.842436 -1.094315    10
B  0.184519  0.937082  0.731000  1.361556  2.092556    20
C -0.326238  0.055676  0.222400 -1.443217 -1.220817    30
D -0.756352  0.816454  0.750445 -0.455947  0.294498    40
E  1.189622 -1.690617 -1.356399 -1.232435 -2.588834    50

In [35]:
df

          W         X         Y         Z       new  new2  new3
A  1.618982  1.541605 -0.251879 -0.842436 -1.094315     1    10
B  0.184519  0.937082  0.731000  1.361556  2.092556     2    20
C -0.326238  0.055676  0.222400 -1.443217 -1.220817     3    30
D -0.756352  0.816454  0.750445 -0.455947  0.294498     4    40
E  1.189622 -1.690617 -1.356399 -1.232435 -2.588834     5    50

In [36]:
df.drop('new2', axis = 1, inplace = True)

In [37]:
df

          W         X         Y         Z       new  new3
A  1.618982  1.541605 -0.251879 -0.842436 -1.094315    10
B  0.184519  0.937082  0.731000  1.361556  2.092556    20
C -0.326238  0.055676  0.222400 -1.443217 -1.220817    30
D -0.756352  0.816454  0.750445 -0.455947  0.294498    40
E  1.189622 -1.690617 -1.356399 -1.232435 -2.588834    50

In [38]:
del df['new3']

In [39]:
df

          W         X         Y         Z       new
A  1.618982  1.541605 -0.251879 -0.842436 -1.094315
B  0.184519  0.937082  0.731000  1.361556  2.092556
C -0.326238  0.055676  0.222400 -1.443217 -1.220817
D -0.756352  0.816454  0.750445 -0.455947  0.294498
E  1.189622 -1.690617 -1.356399 -1.232435 -2.588834

In [40]:
df['W']

A    1.618982
B    0.184519
C   -0.326238
D   -0.756352
E    1.189622
Name: W, dtype: float64

In [42]:
df.loc[['D']]

          W         X         Y         Z       new
D -0.756352  0.816454  0.750445 -0.455947  0.294498

In [43]:
df.loc['F'] = [21,31, 41, 51, 61]

In [44]:
df

           W          X          Y          Z        new
A   1.618982   1.541605  -0.251879  -0.842436  -1.094315
B   0.184519   0.937082   0.731000   1.361556   2.092556
C  -0.326238   0.055676   0.222400  -1.443217  -1.220817
D  -0.756352   0.816454   0.750445  -0.455947   0.294498
E   1.189622  -1.690617  -1.356399  -1.232435  -2.588834
F  21.000000  31.000000  41.000000  51.000000  61.000000

In [45]:
df.drop('F', axis = 0)

          W         X         Y         Z       new
A  1.618982  1.541605 -0.251879 -0.842436 -1.094315
B  0.184519  0.937082  0.731000  1.361556  2.092556
C -0.326238  0.055676  0.222400 -1.443217 -1.220817
D -0.756352  0.816454  0.750445 -0.455947  0.294498
E  1.189622 -1.690617 -1.356399 -1.232435 -2.588834

In [46]:
df.drop('F', axis = 1)

KeyError: "['F'] not found in axis"

In [47]:
df

           W          X          Y          Z        new
A   1.618982   1.541605  -0.251879  -0.842436  -1.094315
B   0.184519   0.937082   0.731000   1.361556   2.092556
C  -0.326238   0.055676   0.222400  -1.443217  -1.220817
D  -0.756352   0.816454   0.750445  -0.455947   0.294498
E   1.189622  -1.690617  -1.356399  -1.232435  -2.588834
F  21.000000  31.000000  41.000000  51.000000  61.000000

In [48]:
df['Y']['D']

0.7504447615341785

In [49]:
df.loc['D']['Y']

0.7504447615341785

In [50]:
df.loc['D', 'Y']

0.7504447615341785

In [51]:
df.loc[['D', 'E', 'F'], ['Y', 'Z']]

           Y          Z
D   0.750445  -0.455947
E  -1.356399  -1.232435
F  41.000000  51.000000

In [52]:
df.iloc[4]

W      1.189622
X     -1.690617
Y     -1.356399
Z     -1.232435
new   -2.588834
Name: E, dtype: float64

In [53]:
df.iloc[4][3]

-1.2324345139149262

In [54]:
df.iloc[3:, 2:4]

           Y          Z
D   0.750445  -0.455947
E  -1.356399  -1.232435
F  41.000000  51.000000